#!/usr/bin/bash

#Валидация
#===========================================================================================
countArgs=$#;
if ! [[ "$countArgs" -eq 2 ]]; then
   echo "Не корректное кол-во аргументов, доступно 2 аргумента";
   exit 1;
fi

summand1=$1;
summand2=$2;

if ! [[ "$summand1" =~ ^-?[0-9]+\.?[0-9]*$ ]] || ! [[ "$summand2" =~ ^-?[0-9]+\.?[0-9]*$ ]]; then
   echo "Значения должны быть числами в формате X, -X, X.X, -X.X";
   exit 1;
fi
#===========================================================================================


#Если числа с плавающей запятой, то доводим их до целых значений и высчитываем коэфециент 
#===========================================================================================
k1=0;
if [[ "$summand1" =~ ^-?[0-9]+\.{1}[0-9]+$ ]]; then
   k1=`echo $summand1 | awk -F"." '{print length($2)}'`;
   summand1="${summand1//./}";
fi

k2=0;
if [[ "$summand2" =~ ^-?[0-9]+\.{1}[0-9]+$ ]]; then
   k2=`echo $summand2 | awk -F"." '{print length($2)}'`;
   summand2="${summand2//./}";
fi

k=0;
if [[ $k1 -eq $k2 ]] && [[ $k1 -gt 0 ]]; then
   k=$(( 10 ** $k1 ));
elif [[ $k1 -gt $k2 ]]; then
   summand2=$(( $summand2 * (10 ** ($k1 - $k2)) ));
   k=$(( 10 ** $k1 ));
elif [[ $k2 -gt $k1 ]]; then
   summand1=$(( $summand1 * (10 ** ($k2 - $k1)) ));
   k=$(( 10 ** $k2 ));
fi
#===========================================================================================


#Складываем и если коэфециент больше 0, то возвращаем на место запятую
#===========================================================================================
sum=$(($summand1 + $summand2));
if [[ $k -gt 0 ]]; then
   sum=`echo "$(($sum / $k)).$(( ${sum#-} % $k ))"`;
fi
#===========================================================================================


#Вывод данных
#===========================================================================================
echo "$1 + $2 = $sum";